jamnikterroru/NRF24_STM32/NRF24_Rx_OLED/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body - LIBRARY VERSION (TIMER BASED)
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "i2c.h"
#include "spi.h"
#include "tim.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include <stdio.h>
#include "NRF24.h"
#include "NRF24_reg_addresses.h"
#include "ssd1306.h"
#include "fonts.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

uint8_t rx_address[5] = {0xE7, 0xE7, 0xE7, 0xE7, 0xE7};


// CRC

// KLUCZ SZYFROWANIA (Może być dowolna liczba 0-255)
#define CRYPTO_KEY 0xA5

// Struktura pakietu (musi być identyczna w Tx i Rx)
// Rozmiar: 4 (temp) + 4 (id) + 2 (crc) = 10 bajtów
// Zmiana: dodane __attribute__((packed))
typedef struct __attribute__((packed)) {
    float temperature;
    uint32_t packet_id;
    uint16_t crc;
} RadioPacket;

RadioPacket myPacket;
uint8_t rx_data[32];

// Prosta funkcja szyfrująca/deszyfrująca (XOR)
void XOR_Cipher(uint8_t* data, uint16_t len) {
    for(int i=0; i<len; i++) {
        data[i] ^= CRYPTO_KEY;
    }
}

// CRC
uint16_t Calc_CRC(uint8_t* data, uint16_t len) {
    uint16_t sum = 0;
    for(int i=0; i<len; i++) {
        sum += data[i];
    }
    return sum;
}


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_TIM2_Init();
  MX_I2C1_Init();
  /* USER CODE BEGIN 2 */

  // --- INICJALIZACJA OLED ---
    // Ekran 0.91" (128x32)
    ssd1306_Init(&hi2c1);
    ssd1306_Fill(Black);
    ssd1306_SetCursor(0, 0);
    ssd1306_WriteString("Oczekuje...", Font_11x18, White);
    ssd1306_UpdateScreen(&hi2c1);

  // --- INICJALIZACJA NRF24 ---
  csn_high();
  ce_high();
  HAL_Delay(100);

  nrf24_init();
  nrf24_tx_pwr(3);          // Max moc
  nrf24_data_rate(0);       // 1Mbps
  nrf24_set_channel(81);
  nrf24_set_addr_width(5);
  nrf24_open_rx_pipe(1, rx_address);
  nrf24_pipe_pld_size(1, sizeof(RadioPacket));
  memset(rx_data, 0, 32);
  nrf24_listen();      // Tryb nadajnika



  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  char oled_buf[32]; // Bufor pomocniczy do tworzenia napisów (sprintf)

  while (1)
    {
        // Sprawdź, czy coś przyszło
        if(nrf24_data_available())
        {
            // 1. Odbierz dane (zaszyfrowana struktura)
            nrf24_receive(rx_data, sizeof(RadioPacket));

            // 2. ODSZYFRUJ (XOR)
            // Przywracamy dane do formy czytelnej dla procesora
            XOR_Cipher(rx_data, sizeof(RadioPacket));

            // 3. Skopiuj surowe bajty do struktury, żeby mieć do nich łatwy dostęp
            memcpy(&myPacket, rx_data, sizeof(RadioPacket));

            // 4. Sprawdź Sumę Kontrolną (CRC)
            // Liczymy CRC z tego co odebraliśmy (bez ostatnich 2 bajtów, które są CRC)
            uint16_t calculated_crc = Calc_CRC((uint8_t*)&myPacket, sizeof(RadioPacket) - 2);

            ssd1306_Fill(Black);

            if (calculated_crc == myPacket.crc)
                      {
                          // --- DANE POPRAWNE ---
                          if(myPacket.temperature <= -900.0f) // Sprawdzenie błędu czujnika
                          {
                              ssd1306_SetCursor(0, 5);
                              ssd1306_WriteString("Sensor Error!", Font_11x18, White);
                          }
                          else
                          {
                              // Wyświetl ID pakietu
                              sprintf(oled_buf, "Pck: %lu", myPacket.packet_id);
                              ssd1306_SetCursor(0, 0);
                              ssd1306_WriteString(oled_buf, Font_7x10, White);

                              // Wyświetl Temperaturę
                              sprintf(oled_buf, "%.2f C", myPacket.temperature);
                              ssd1306_SetCursor(0, 12);
                              ssd1306_WriteString(oled_buf, Font_11x18, White);
                          }
                          HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13);
                      }
                      else
                      {
                          // --- BŁĄD CRC ---
                          ssd1306_SetCursor(0, 0);
                          ssd1306_WriteString("SEC ERROR", Font_7x10, White);

                          ssd1306_SetCursor(0, 12);
                          ssd1306_WriteString("Bad Key/CRC", Font_11x18, White);
                      }

                      // 5. Wyślij na ekran (tylko tutaj!)
                      ssd1306_UpdateScreen(&hi2c1);
                  }

                  HAL_Delay(1);
      /* USER CODE END WHILE */
      /* USER CODE BEGIN 3 */
    }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
